## Base Python

In [1]:
marks = [45,12,49,19,49,1]

In [2]:
pass_mark = 20

In [4]:
for mark in marks:
    print(mark)
    if mark<pass_mark:
        print("fail")
    else:
        print("pass")
    print("------------")

45
pass
------------
12
fail
------------
49
pass
------------
19
fail
------------
49
pass
------------
1
fail
------------

What is the difference between list and tuple?

The elements in a tuple cannot be changed or rearranged whereas we can perform operations like addition or deletion in a list that would result a list to be changed or rearranged.

In [6]:
#Functions: Example - Range
x = range(4,40,4)
for i in x:
    print(i)

4
8
12
16
20
24
28
32
36

In [8]:
#user defined function
def summ(n1=0, n2=0):
    return n1+n2

In [9]:
summ(n1=9,n2=10)

19

# Python for DS

In [10]:
import pandas as pd
import numpy as np

In [11]:
marks_series = pd.Series(marks)

In [12]:
marks_series

0    45
1    12
2    49
3    19
4    49
5     1
dtype: int64

In [13]:
marks_series[:4]

0    45
1    12
2    49
3    19
dtype: int64

In [16]:
df = pd.DataFrame([marks,marks]).T
df

    0   1
0  45  45
1  12  12
2  49  49
3  19  19
4  49  49
5   1   1

In [17]:
df.columns = ['Marks1','Marks2']

In [18]:
df

   Marks1  Marks2
0      45      45
1      12      12
2      49      49
3      19      19
4      49      49
5       1       1

In [20]:
#Working with data

In [22]:
data = pd.read_csv("adv1.csv")

In [23]:
data.head()

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3   12.0
3  151.5   41.3       58.5   16.5
4  180.8   10.8       58.4   17.9

In [24]:
data.tail()

        TV  Radio  Newspaper  Sales
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1   14.0
197  177.0    9.3        6.4   14.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   18.4

In [25]:
type(data['Newspaper'])

pandas.core.series.Series

In [26]:
data['Newspaper'].value_counts()

9.3     3
25.6    3
8.7     3
34.6    2
8.5     2
       ..
27.2    1
31.7    1
19.3    1
31.3    1
66.2    1
Name: Newspaper, Length: 172, dtype: int64

In [28]:
data.shape

(200, 4)

In [29]:
data.isna().sum()

TV           0
Radio        0
Newspaper    0
Sales        0
dtype: int64

In [30]:
data.columns

Index(['TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [33]:
data['Sales']>20

0       True
1      False
2      False
3      False
4      False
       ...
195    False
196    False
197    False
198     True
199    False
Name: Sales, Length: 200, dtype: bool

In [34]:
data.corr()

                 TV     Radio  Newspaper     Sales
TV         1.000000  0.054809   0.056648  0.901208
Radio      0.054809  1.000000   0.354104  0.349631
Newspaper  0.056648  0.354104   1.000000  0.157960
Sales      0.901208  0.349631   0.157960  1.000000

In [35]:
data.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   15.130500
std     85.854236   14.846809   21.778621    5.283892
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   11.000000
50%    149.750000   22.900000   25.750000   16.000000
75%    218.825000   36.525000   45.100000   19.050000
max    296.400000   49.600000  114.000000   27.000000